windTurbineCase/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     pimpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         10.0; //1.0;

deltaT          0.0002;

writeControl    runTime;
writeInterval   0.05;

purgeWrite      0;

adjustTimeStep  yes;
maxCo           1.0;
maxDeltaT       0.0005;

writeFormat     binary;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

#include "forces"