windTurbineCase/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

// Diâmetro da hélice D ≈ 0.436 m
// Upstream   : 5D  ≈ 2.2 m  → y = -2.2
// Downstream : 10D ≈ 4.4 m  → y = +4.4
// Lateral    : 5D  ≈ 1.1 m  → x,z = ±1.1

vertices
(
    ( -1.1  -2.2  -1.1 )  // 0
    (  1.1  -2.2  -1.1 )  // 1
    (  1.1   4.4  -1.1 )  // 2
    ( -1.1   4.4  -1.1 )  // 3
    ( -1.1  -2.2   1.1 )  // 4
    (  1.1  -2.2   1.1 )  // 5
    (  1.1   4.4   1.1 )  // 6
    ( -1.1   4.4   1.1 )  // 7
);

blocks
(
    // (nx ny nz): células proporcionais ao tamanho de cada eixo
    // X: 2.2 m  → 22 células (~10cm cada)
    // Y: 6.6 m  → 66 células
    // Z: 2.2 m  → 22 células
    hex (0 1 2 3 4 5 6 7) (22 66 22) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ( (0 1 5 4) );  // y = -2.2
    }

    outlet
    {
        type patch;
        faces ( (3 7 6 2) );  // y = +4.4
    }

    sides
    {
        type wall;
        faces
        (
            (0 4 7 3)  // x = -1.1
            (1 2 6 5)  // x = +1.1
            (0 3 2 1)  // z = -1.1
            (4 5 6 7)  // z = +1.1
        );
    }
);
