windTurbineCase/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.02;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.02;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.02;
        value           uniform 0.02;
    }
    sides
    {
        type            kqRWallFunction;
        value           uniform 0.02;
    }
    propeller
    {
        type            kqRWallFunction;
        value           uniform 0.02;
    }
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}