windTurbineCase/0/pointDisplacement
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    sides
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    propeller
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    AMI1
    {
        type            cyclicAMI;
    }

    AMI2
    {
        type            cyclicAMI;
    }
}
